"""
6. Создать текстовый файл test_file.txt,
заполнить его тремя строками:
«сетевое программирование», «сокет», «декоратор».
Проверить кодировку файла по умолчанию.
Принудительно открыть файл в формате Unicode и вывести его содержимое.
"""

with open('test_file.txt') as f:
    print(f.encoding)

# Результат:
# UTF-8

with open('test_file.txt', encoding='utf-8') as f:
    for line in f:
        print(line, end='')

# Результат:
# сетевое программирование
# сокет
# декоратор
